{
  "newspapers": {
    "cnn": {
      "link": "http://edition.cnn.com/",
      "articles": [
        {
          "title": "'Huge explosion' in Ghana after vehicle carrying mining explosives hits motorcycle",
          "text": "(CNN) Multiple people were killed in a \"huge explosion\" that took place after a motorcycle collided with a vehicle carrying explosives in Ghana Thursday, according to police and one eyewitness.\n\nThe blast appeared to have completely leveled Apiate, a small town in western Ghana. Kwadwo Bempah, who works in the area and heard the explosion, told CNN that nearly every building there had collapsed, trapping people and animals trapped under rubble.\n\nThe dead, he said, were \"all around.\"\n\n\"It is a real tragedy for Ghana,\" Bempah said.\n\nPolice said most of the victims have been rescued and admitted to various hospitals and clinics. No more details were released on their condition.\n\nRead More",
          "link": "http://edition.cnn.com/2022/01/20/africa/ghana-explosion-emergency-intl/index.html",
          "published": "2022-01-20T00:00:00"
        }
      ]
    },
    "bbc": {
      "rss": "http://feeds.bbci.co.uk/news/rss.xml",
      "link": "http://www.bbc.com/",
      "articles": [
        {
          "link": "https://www.bbc.co.uk/news/uk-politics-60068612?at_medium=RSS&at_campaign=KARANGA",
          "published": "2022-01-20T21:36:40",
          "title": "Boris Johnson: I've seen no evidence of plotters being blackmailed",
          "text": "Scotland's First Minister, the SNP's Nicola Sturgeon, said: \"If Tories are threatening to withhold public investment from constituencies as a way of keeping MPs in line then, yes, that's blackmail and intimidation - but it is also corruption."
        },
        {
          "link": "https://www.bbc.co.uk/news/business-60065207?at_medium=RSS&at_campaign=KARANGA",
          "published": "2022-01-20T15:56:51",
          "title": "Bankers told to return to desks as restrictions end",
          "text": "Chris Hirst, global head of creative at Havas, told the BBC's Today programme: \"Many of our employees really do want to come back into the office, but there are some people who are nervous and we don't have a one-size-fits-all approach to that."
        },
        {
          "link": "https://www.bbc.co.uk/news/business-60057282?at_medium=RSS&at_campaign=KARANGA",
          "published": "2022-01-20T17:32:26",
          "title": "BT to introduce inflation-busting price rises",
          "text": "\"Unlike most things we buy, like food, electricity or fuel, you don't pay more for using more as our data plans are unlimited, but we need to keep investing in our networks so they can handle this huge increase in demand,\" he said."
        },
        {
          "link": "https://www.bbc.co.uk/news/world-us-canada-60076895?at_medium=RSS&at_campaign=KARANGA",
          "published": "2022-01-20T20:18:15",
          "title": "Capitol riot inquiry asks Ivanka Trump to voluntarily testify",
          "text": "\"Testimony obtained by the Select Committee indicates that members of the White House staff requested your assistance on multiple occasions to intervene in an attempt to persuade President Trump to address the ongoing lawlessness and violence on Capitol Hill,\" he adds in the letter, which asks her to speak to the committee next month."
        }
      ]
    },
    "theguardian": {
      "rss": "https://www.theguardian.com/uk/rss",
      "link": "https://www.theguardian.com/international",
      "articles": [
        {
          "link": "https://www.theguardian.com/politics/2022/jan/20/boris-johnson-ministers-confidence-vote-whipping",
          "published": "2022-01-20T20:19:34",
          "title": "Ministers accused of intimidating MPs who oppose Boris Johnson",
          "text": "Tory whips were accused on Thursday of using dirty tactics to intimidate rebels as Boris Johnson was said to be increasingly convinced he could see off a vote of no confidence.\n\nThough allies of Johnson believe a vote is almost inevitable after the inquiry into Downing Street parties is published next week, one cabinet minister said on Thursday there were now significant doubts among the rebels about whether they could defeat the prime minister.\n\nThe Guardian has been told of at least five MPs who have expressed concerns about the government threatening funding for their constituency or encouraging damaging stories to be published in newspapers.\n\nMPs said the tactic had been used not only during the so-called partygate scandal, but ahead of the votes on Uighur genocide, cutting international aid, free school meals and the rise in national insurance.\n\nA No 10 spokesperson said: “We are not aware of any evidence to support what are clearly serious allegations. If there is any evidence to support these claims we would look at it very carefully.” Johnson said he had “seen no evidence” of those threats.\n\nThe row over whipping tactics came amid other developments as:\n\nA significant email from a senior official warning Martin Reynolds not to hold the summer party on 20 May has now been obtained by the inquiry by Sue Gray.\n\nAnger among Johnson critics escalated after sources briefed that rebels were losing their nerve. MPs denied that letters of no confidence had been withdrawn, calling it spin by Number 10.\n\nLeading Brexiter Steve Baker said it looked like “checkmate” for the prime minister.\n\nAs allies of Johnson claimed the prime minister was being given a reprieve before the Gray report, senior Tory William Wragg, who chairs a government scrutiny committee, claimed there was attempted blackmail against some colleagues involving public money.\n\nHe urged MPs to report government ministers, whips and advisers to the Speaker – and even the police.\n\nTwo of the MPs, the Tory defector Wakeford and Andrew Bridgen, another Johnson critic, spoke publicly on Thursday about the tactics they claim had been deployed against them.\n\nWakeford backed up the claims by Wragg that threats involving public money were made by the whips.\n\n“I was threatened that I would not get a school for Radcliffe if I did not vote in one particular way,” he said. “This is a town that has not had a high school for the best part of 10 years.\n\n“How would you feel when they hold back the regeneration of a town for a vote. It didn’t sit comfortably. That was the start of me questioning my place, where I was and ultimately to where I am now.”\n\n00:35 Christian Wakeford claims he was threatened with loss of funding over vote – video\n\nWragg, who chairs the public administration and constitutional affairs committee (PACAC), which looks into the work of government and the civil service, said it would breach the ministerial code “in threatening to withdraw investment from members of parliaments’ constituencies which are funded from the public purse”.\n\nHe said encouraging the publication of stories in newspapers would also be a breach. “The intimidation of a member of parliament is a serious matter,” he added. “Moreover, the reports of which I’m aware would seem to constitute blackmail.\n\n“As such it would be my general advice to colleagues to report these matters to the Speaker of the House of Commons and the commissioner of the Metropolitan police.”\n\nBridgen, a Conservative backbencher who was among the first MPs to call for Johnson to go, said he believed a story in the Times on Monday detailing his links to a Ghana-based timber company had been inspired by No 10.\n\n“Not only am I confident that happened, but so are all my colleagues,” Bridgen, MP for North West Leicestershire since 2010, told the Guardian. “One of them told me, ‘It’s not even subtle nowadays.’”\n\nOne former minister said he was incensed by the tactic of threatening to cut funding to seats. “It has unusually high leverage with our newer colleagues. We have young, new members with marginal seats in poor areas.\n\n“That’s precisely the area where the seat is dependent on allocations of money and the levelling up regime. The scope for this kind of threat is much more than it would have been. If you use this tactic all the red wall are susceptible to it.”\n\nThe Speaker, Lindsay Hoyle, said allegations about potentially criminal offences would be a matter for the police.\n\nAngela Rayner, Labour’s deputy leader, said the alleged threats to withdraw investment to force support for Johnson were “disgusting” and Ed Davey, the Lib Dem leader, said Johnson was “now in full scorched earth mode”.\n\nOne cabinet minister said Johnson was increasingly confident that he could “probably win” in a vote of no confidence and called the whipping row “a sideshow”.\n\nHe said colleagues were beginning to think it was “electoral suicide” to depose Johnson. “When you start to put it to people that the prime minister who got us this huge majority might have to go over cheese and wine – well it starts to look ridiculous.”\n\nBut other MPs said Johnson was still in deep peril. “There are a lot of people who do not like these kinds of threats; they don’t like bullies,” one MP said. Another MP opposing Johnson denied that letters of no confidence had been withdrawn after Wakeford defected to Labour.\n\n“These briefings of withdrawals are pure invention from No 10,” one said. “Wakeford may have stayed some people’s hands yesterday but this isn’t going into reverse.”\n\nJohnson is understood to be keen for Gray’s report to be published by Tuesday, to allow him to make a statement before facing another PMQs on Wednesday.\n\nA significant email from a senior official warning Martin Reynolds not to hold the summer party on 20 May has now been obtained by Gray, first reported by ITV.\n\nCabinet Office sources said she had already been given the authority to search email records – which are retained even from departing officials. A Whitehall source said Gray is nearing the end of her inquiry and publication next week was very likely.\n\nBaker, a key Westminster figure who often led rebellions including on Brexit and Covid, said he would not be organising against the prime minister but said he should resign if he broke the law or misled parliament.\n\n“I’m appalled we’ve reached this position,” he told the BBC’s Political Thinking podcast.\n\n“At the moment I’m afraid it does look like checkmate but whether he can save himself, we’ll see … I’m very clear that if he’s broken the law or lied at the dispatch box, then he must go. But one thing I would say I’m not going to organise against Boris Johnson, my heart wouldn’t be in it.”"
        },
        {
          "link": "https://www.theguardian.com/society/2022/jan/20/ministers-and-nhs-bosses-clash-over-surgery-waiting-list-targets-in-england",
          "published": "2022-01-20T19:37:02",
          "title": "Ministers and NHS bosses clash over surgery waiting list targets in England",
          "text": "A “very tense” behind-the-scenes row over how quickly hospitals in England can be expected to reduce the massive backlog of surgery has broken out between NHS bosses and ministers.\n\nThe dispute has delayed publication of the government’s “elective recovery plan”, which Downing Street had indicated would be part of Boris Johnson’s “Operation Red Meat” political fightback this week.\n\nJohnson’s plan for salvaging his premiership after revelations of lockdown-busting parties at Downing Street has been to announce a slew of populist policies, including freezing the BBC licence fee for two years.\n\nNo 10, the Treasury and Department of Health and Social Care are pressing NHS England to ensure that hospitals do as many operations as they can, as quickly as possible, in order to tackle the backlog, which now stands at a record 6 million patients.\n\nThey want to impose “stretching and demanding” targets on hospitals, sources with knowledge of the discussions said.\n\nHowever, NHS trust bosses say the ongoing impact of treating patients sick with Covid, due to the current Omicron surge, longstanding gaps in their workforce, exhaustion at the frontline and record levels of staff sickness, mean they need time to get back to doing as much surgery as they did before the pandemic.\n\nThe Treasury is said to be frustrated with NHS England and privately believes it is “foot-dragging” over the targets. NHS bosses for their part fear the plan is being driven by “political expediency”, given the growing concern at the sheer number of people facing long delays for care.\n\nOne source said: “The Treasury are keen to set out some pretty bold targets but there’s been pushback on that [from the NHS]. The Treasury are saying ‘let’s really crack on’, and the NHS is saying ‘let’s just keep it real and remember the pressures on us just now from Covid, the vaccination programme and other things.’”\n\nBoth sides agree that targets for what percentage of pre-Covid levels of non-urgent care hospitals should get back to providing, and by when, will be a key element of the “elective recovery plan”. It was due to appear last month but was delayed when Omicron struck in early December and threatened to overwhelm the NHS, forcing some trusts to cancel some non-urgent surgery.\n\nHowever, hospital bosses say the targets have to be “realistic”, given the pressures they are under. One NHS official said ministers needed to be pragmatic and “not set up the NHS to fail”.\n\nMatthew Taylor, the chief executive of the NHS Confederation, which represents health service trusts, said: “We need to set stretching targets but the worst thing the government could do is to set unrealistic targets that risk undermining public confidence in the NHS if and when they are not achieved.”\n\nMinisters should wait several weeks, until the full impact of Omicron is known, before finalising the targets, he added.\n\nHospitals were already doing their best to make inroads into their waiting-lists, Taylor said. “But they are facing a demand crunch of rapidly rising demand for care, high hospital admissions from Covid and staff absences that are double the normal level for this time of year.”\n\nThe fast-growing backlog of care is emerging as a key political priority for Johnson. Last week brought another set of grim NHS performance figures. They showed that the number of people on the waiting list had reached almost 6 million, that more than 2 million people had already waited beyond the supposed maximum of 18 weeks and 18,585 had waited more than two years.\n\nThe waiting list already stood at 4.4 million before the pandemic. But Covid’s disruption to many normal hospital services, and people’s reluctance to seek NHS care while infection rates have been so high, have pushed it to record levels. It has been growing by about 150,000 people every month since last year.\n\nThe prime minister has appointed a team of officials, all with significant NHS experience, to advise him how waiting lists can be brought down and to scrutinise NHS England’s progress. Sir Michael Barber, the ex-head of Tony Blair’s Downing Street delivery unit, who is a firm believer that targets ensure the NHS delivers, has been advising the health secretary, Sajid Javid, on the backlog.\n\nChris Hopson, the chief executive of the hospitals group NHS Providers, told the Health Service Journal earlier this week that ministers should wait to see Omicron’s full effect on the NHS before finalising the detail of what the targets will be.\n\n“The bit that needs careful thought, and risks not being done if the plan is rushed out too quickly, is what difference Omicron is making and what the NHS can sensibly commit to, particularly for 2022-23, given the significant disruption that the Omicron surge has caused”, he said.\n\nA DHSC spokesperson said: “The pandemic has put enormous pressures on the NHS, but we are committed to making sure people get the treatment they need.\n\n“We have provided an additional £5.9bn to help tackle the Covid backlogs and we are investing £36bn over three years. The elective recovery plan is an important part of our recovery, and we will set out the details in due course.”\n\nMeanwhile, patients who are worried that they may have cancer but are having no luck with their GP can call a hotline for help, a health minister has told MPs.\n\nMaria Caulfield, the minister for patient safety and primary care, told the Commons health and social care committee that the NHS was piloting cancer hotlines staffed by nurse specialists as a route towards rapid diagnosis."
        },
        {
          "link": "https://www.theguardian.com/world/2022/jan/20/us-russia-ukraine-government-sanctions",
          "published": "2022-01-20T18:03:10",
          "title": "US accuses Russia of conspiring to take over Ukraine government",
          "text": "The US has alleged that Russian intelligence is recruiting current and former Ukrainian government officials to take over the government in Kyiv and cooperate with a Russian occupying force.\n\nThe US Treasury on Thursday imposed sanctions on two Ukrainian members of parliament and two former officials it said were involved in the alleged conspiracy, which involved discrediting the current government of the president, Volodymyr Zelenskiy.\n\n“Russia has directed its intelligence services to recruit current and former Ukrainian government officials to prepare to take over the government of Ukraine and to control Ukraine’s critical infrastructure with an occupying Russian force,” the Treasury statement accompanying the sanctions said.\n\nThe claims suggest US intelligence fears Russia is preparing a full-scale invasion and not the “minor incursion” that Joe Biden referred to as a possibility in remarks on Wednesday that triggered alarm in Kyiv.\n\nOnline researchers have identified Russian troops and military vehicles within just ten miles of Ukraine’s borders, increasing the risk that Vladimir Putin could launch a military offensive on short notice.\n\nLocal media showed Russian troops arrived in the town of Yelsk in Belarus and at other points near the border with Ukraine as part of joint military exercises set to begin next month. Russian forces there include rocket artillery, anti-air systems, and possibly elite units such as speznaz.\n\nAn investigation by the Conflict Intelligence Team and Radio Svoboda raised questions of whether the deployments were just an exercise, as some family members said the soldiers were deploying for months.\n\nIn his earlier remarks Biden seemed to say that if Russia invaded just a small part of Ukraine, the Nato alliance would be divided on how to respond. Speaking on Thursday, the US president sought to clarify those comments.\n\n“If any assembled Russian units move across the Ukrainian border, that is an invasion,” he said. “Let there be no doubt if Putin makes this choice, Russia will pay a heavy price.”\n\nBiden added that the US and its allies would also have to be ready to respond if Russia employed “measures other than overt military action to carry out aggression” against Ukraine.\n\nThe president was speaking soon after Zelenskiy complained in a tweet: “We want to remind the great powers that there are no minor incursions and small nations. Just as there are no minor casualties and little grief from the loss of loved ones.”\n\nThe US has threatened unprecedented sanctions against Russia if it goes ahead with an invasion, though there are disagreements with European allies, as Biden admitted on Wednesday, on how extensive the punitive measures should be. European capitals have resisted the suggestion that Russia should be cut off from the international electronic payment system, Swift.\n\nThe US, the UK and other allies have also continued to supply arms to Ukraine, in a move aimed at raising the costs of an invasion, and potentially contributing to a Ukrainian insurgency in the wake of an invasion.\n\nDespite the threats, Russian forces have continued to build up near the Ukrainian border. Short-range ballistic missiles and tanks have been pictured heading westwards on trains from positions in Russia’s far east. Satellite imagery shows increasing numbers of encampments of men and equipment in the Ukrainian border region, and Russian and Belarusian troops have been conducting military exercises, which the US says are unusually large and carried out without giving sufficient notice.\n\nThe two MPs the US has placed sanctions on were named as Taras Kozak and Oleh Voloshyn, both members of a pro-Russian party led by Victor Medvedchuk, an oligarch who has been under house arrest in Ukraine since last May, accused of treason.\n\nA former Ukrainian official, Volodymyr Oliynyk, now living in Russia, has a sanction against him for working “at the direction of the FSB [Russian intelligence] to gather information about Ukrainian critical infrastructure”.\n\nThe fourth man named is Vladimir Sivkovich, a former deputy secretary of the Ukrainian national security and defence council.\n\n“In 2021, Sivkovich worked with a network of Russian intelligence actors to carry out influence operations that attempted to build support for Ukraine to officially cede Crimea to Russia in exchange for a drawdown of Russian-backed forces in the Donbas,” the US Treasury alleged.\n\nVoloshyn denied being a Russian asset and said he had never “wittingly” talked to the FSB or any other Russian spy agency. He said he was an elected MP for an explicitly pro-Russian political party and that his US-sceptical views reflected those of some Ukrainian voters.\n\nVoloshyn said he suspected he was being punished for calling – unsuccessfully – for a parliamentary investigation into Biden’s son, Hunter, and his work in Ukraine.\n\nIn an interview, Voloshyn described US accusations against him as “strange”. He said he had been interviewed by the FBI last summer when he flew to Washington, adding that he had been in contact regularly in the past with the US embassy in Kyiv.\n\nHe said he last visited Moscow in November for a national prayer breakfast – his first trip to Russia for two years. “There were several Americans at the same breakfast,” he said. Voloshyn said he knew Kozak but had never met the other two Ukrainians targeted with sanctions.\n\nThe three other men could not immediately be reached for comment. Russia has denied it plans to invade Ukraine, but it has massed over 100,000 troops along the country’s border.\n\n“There’s been a lot of speculation about President Putin’s true intentions, but we don’t actually have to guess. He’s told us repeatedly. He’s laying the groundwork for an invasion because he doesn’t believe that Ukraine is a sovereign nation,” the US secretary of state, Tony Blinken, said in a speech in Berlin.\n\nBlinken is due to meet his Russian counterpart, Sergei Lavrov, in Geneva on Friday.\n\nThree sets of talks between Russia, the US, Nato and other European states last week, failed to make any progress.\n\nThe US and Nato have offered negotiations on limiting missile deployments and military exercises, but Russian officials have demanded sweeping security guarantees, that Ukraine is never join Nato, and that the alliance will withdraw forces from member states in eastern Europe who were once part of the communist bloc."
        },
        {
          "link": "https://www.theguardian.com/world/2022/jan/20/belgian-briton-zara-rutherford-is-youngest-woman-to-fly-solo-around-world",
          "published": "2022-01-20T14:30:10",
          "title": "Belgian-Briton Zara Rutherford is youngest woman to fly solo around world",
          "text": "A Belgian-British teenager has flown into the record books by becoming the youngest woman to fly solo around the world.\n\nZara Rutherford, 19, touched down at Kortrijk-Wevelgem airport in Flanders just after 1pm local time on Thursday, completing a 52,000km (28,100 nautical mile) journey that took in 31 countries across five continents.\n\n“It’s just really crazy. I haven’t quite processed it,” Rutherford, draped in British and Belgian flags, told reporters.\n\nShe said there had been “amazing moments”, but also times when she had feared for her life. “I’d say the hardest part was flying over Siberia, because it was just extremely cold. It was minus 35 degrees on the ground … If the engine were then to stop, I’m hours away from rescue and I don’t know how long I could survive.”\n\nMaking a smooth landing on the runway, she became the first woman to fly alone around the world in a microlight plane and the first Belgian to circumnavigate the globe solo by air. Rutherford’s parents are pilots and started taking her up in small planes when she was a toddler. By the age of 14 she was learning to fly and dreaming of a round-the-world trip.\n\n“The dream was really to fly around the world. But I always thought it was impossible: it’s expensive, dangerous, complicated, a logistical nightmare,” she said in a TV interview earlier this month. “So I never really thought about it twice. And then I was finishing school and I thought: if I am going to do something crazy with my life this is the perfect time to do it.”\n\nOn 18 August last year she took off in her two-seater Shark Aero, one of the fastest lightweight aircraft in the world, which can reach speeds of up to 300km/h. Flying west, she stopped in the UK, Greenland, the Americas and Russia, then looped down to south-east Asia, north to India, the Middle East and Egypt, and back to Europe.\n\nUnable to fly at night or in clouds, Rutherford could only fly during clear daylight. She encountered all weathers, including conditions she had never been trained to deal with in temperate Belgium. There were freezing temperatures in Greenland, Alaska and Russia, desert haze in Saudi Arabia, thunderstorms at the equator, wildfires over California and smog over India that reduced visibility.\n\nRussia was her toughest challenge but also one of the highlights. “One of the most impressive moments was flying over Siberia, because it is just so remote and I don’t know if I’ll ever get to see it again,” she said. Saudi Arabia also stood out as “really beautiful, very diverse and the weather was great”.\n\nA snowstorm grounded her in the north-eastern Russian city of Magadan for a week. Extreme weather also forced a three-week stay in Ayan, a small town of 800 people in the country’s far east, with few English speakers and no wifi. Locals were “very kind and willing to help”, she said.\n\nRutherford also had to navigate fast-changing Covid restrictions and bureaucracy. She cancelled a stop in China after a government change of rules meant she would have had to quarantine.\n\nThis became one of the scariest moments of the trip, when she had to navigate one of the busiest aviation routes in the world to reach South Korea while avoiding Chinese and North Korean airspace.\n\nHer journey from Mumbai to Dubai was a gruelling eight-hour flight mostly over water, ending with a diversion to another airport 60 miles south of the Emirati city because of a rare storm.\n\nThen there were routine chores. Christmas Day in Singapore was spent dealing with a flat tyre. When she was stuck in Alaska waiting for her Russian visa, she worked on plane maintenance and applying to universities.\n\nNow back in Belgium, she plans to study electrical engineering and hopes to become an astronaut. The teenager, who cites her inspirations as the American aviation pioneer Amelia Earhart and the Russian cosmonaut Valentina Tereshkova, said she hoped her journey would encourage more girls to take up science and engineering.\n\n“Growing up I didn’t really see many female pilots or female computer scientists,” she has said. “Those are two of my passions and it’s quite discouraging when there is no one that you can relate to that does any of those things.”\n\nShe said she hoped “other girls see me and think: ‘I’d love to fly one day, too.’”"
        }
      ]
    },
    "breitbart": {
      "link": "http://www.breitbart.com/",
      "articles": [
        {
          "title": "Poll: Majority of Americans Say America on the ‘Wrong Track’ One Year into Biden’s Presidency",
          "text": "Most Americans believe America is on the “wrong track” one year into Joe Biden’s presidency, an Economist/YouGov survey released this week found.\n\nThe survey found 64 percent indicating the country is headed off on the “wrong track” one year into Biden’s presidency, while less than a quarter, 23 percent, say it is “generally headed in the right direction.” What is more, nearly three-quarters rate the current state of the American economy as either “fair” or “poor.” Of those, 44 percent say it is “poor,” despite the administration declaring victory on that specific issue. Those sentiments are shared in a recent Morning Consult poll, which found 65 percent of Americans saying the country is not going in the right direction. Yet, on Wednesday, Biden made it clear he does not share that view.\n\n“What is the trajectory of the country? Is it moving in the right direction now?” he asked. “I don’t know how we can say it’s not.”\n\nThe survey also asked respondents to indicate how much progress Biden made over the past year in achieving a series of campaign promises. Across the board, a majority indicated that he only made either a “little” progress or “none” at all on key issues, such as getting the coronavirus under control or getting bipartisan support in Congress for economic relief.\n\nThirty-five percent, specifically, said Biden made no progress on getting the pandemic under control, while 17 percent said he made “only a little” progress. Similarly, 42 percent said Biden saw no progress on getting bipartisan support in Congress for economic relief, while 19 percent said he made “only a little” progress on that issue. The figures are similar on other issues as well, such as forgiving student loan debt, increasing the federal minimum wage, and putting the U.S. on track to have a clean energy economy.\n\nThe survey, taken January 15-18, 2022, among 1,500 U.S. citizens, has a margin of error of +/- 2.8 percent.",
          "link": "https://www.breitbart.com/politics/2022/01/20/poll-majority-americans-say-america-wrong-track-one-year-bidens-presidency/",
          "published": "2022-01-20T00:00:00"
        },
        {
          "title": "Ukraine’s Zelensky: ‘There Are No Minor Incursions’",
          "text": "Ukrainian President Volodymyr Zelensky on Thursday rejected comments made the day before by President Joe Biden that appeared dismissive of a potential Russian invasion of his country, affirming in a statement to social media, “There are no minor incursions.”\n\nBiden told reporters on Wednesday the United States may not aid Ukraine, a longtime ally, in the event that Russian leader Vladimir Putin invades as long as the invasion is a “minor incursion.” He did not define the term “minor incursion.” Biden also predicted that Putin would invade the country and that he could colonize it, but not without significant losses, and insisted Moscow would “be held accountable” but provided no details as to how.\n\nZelensky has been asking Biden for one specific action throughout the past year to punish Russia for its ongoing support of separatists in Donbas, eastern Ukraine, and for its colonization of Ukraine’s Crimean Peninsula: to sanction the Nord Stream 2 gas pipeline project, which would greatly enrich Moscow, grant it outsized influence over western Europe, and significantly damage the Ukrainian economy. The pipeline would connect Russia to Germany.\n\nBiden lifted existing sanctions on Nord Stream 2 this summer and has refused to impose any more, instead suggesting his administration would only sanction the project and Russia generally after an invasion of Ukraine. Neither Biden nor any reporters mentioned Nord Stream 2 during his press conference on Wednesday.\n\nWithout mentioning America, Zelensky appeared to directly reject Biden’s dismissal of any potential Russian invasion of his country as a “minor incursion” – and suggested Biden was dismissing the value of Ukrainian lives, a point Zelensky has made in the past.\n\n“We want to remind the great powers that there are no minor incursions and small nations,” Zelensky asserted, “Just as there are no minor casualties and little grief from the loss of loved ones.”\n\nZelensky asserted that Ukraine is a “great power.”\n\nWe want to remind the great powers that there are no minor incursions and small nations. Just as there are no minor casualties and little grief from the loss of loved ones. I say this as the President of a great power 🇺 — Володимир Зеленський (@ZelenskyyUa) January 20, 2022\n\nIn June, after Biden lifted sanctions on Nord Stream 2, Zelensky used similar language in an angry interview with the D.C. outlet Axios, indicating Biden held the viewpoint that “there are the great powers of the world, and there is everybody else.”\n\n“I understand that the relationship between the United States and Germany is very important,” Zelensky said at the time, referring to Nord Stream 2. “I wouldn’t want to intervene between these two esteemed countries. However, how many Ukrainian lives does the relationship between the United States and Germany cost?”\n\nBiden told reporters on Wednesday that he expected Putin to “move in” to Ukraine because “he has to do something” and that Russia “will be held accountable” for such a move, but only if it meets an undetermined threshold of significance.\n\n“Russia will be held accountable if it invades. And it depends on what it does. It’s one thing if it’s a minor incursion and then we end up having a fight about what to do and not do, et cetera,” Biden said, without clarifying the latter point.\n\n“He’s never seen sanctions like the ones I promised will be imposed if he moves,” Biden also asserted, without elaborating.\n\nZelensky’s English-language post on Twitter followed a televised speech Wednesday night intended to pacify panicked Ukrainians and deny Biden’s assertions that Russia would imminently invade Ukraine (again). Zelensky urged Ukrainians to “take a deep breath” and “calm down,” and reminded them Russia was already invading the country and such threats were not knew.\n\n“Didn’t the invasion start in 2014? Has the threat of war emerged just now? These risks have existed for more than a year, and they haven’t increased,” Zelensky asserted. “What has increased is the hype around them.”\n\n“Keep your head calm and cool, remain confident in your strength, in your Army, in our Ukraine,” Zelensky advised. “Do not get anxious, react smartly to everything, not emotionally! With your head, not your heart.”\n\nThe Russian government responded to Biden’s comments on Thursday by accusing him of preparing his own “military” provocations and using Ukraine as a distraction.\n\n“Western and Ukrainian media outlets and officials have been increasingly engaged in rumors of Russia’s pending invasion of Ukraine,” Russian Foreign Ministry Spokeswoman Maria Zakharova told reporters during her daily briefing, according to the Russian news agency Tass. “We are certain that this crusade is aimed at creating an information cover-up for preparing their own large-scale provocations, including those of a military nature, that may have the most tragic consequences for regional and global security.”\n\n“We urge Western countries to halt the hostile anti-Russian media crusade, [stop] abetting Ukraine’s militarization by dragging it into NATO and instead channel all efforts into prompting the Kyiv regime to honor the Minsk Accords and other international commitments,” Zakharova asserted.\n\nRussia maintains it has no involvement in the Donbas war and that the conflict is a civil one between Ukrainians, contrary to extensive evidence of Russian support for the separatists in the region.\n\nFollow Frances Martel on Facebook and Twitter.",
          "link": "https://www.breitbart.com/politics/2022/01/20/zelensky-to-biden-no-minor-incursions/",
          "published": "2022-01-20T00:00:00"
        },
        {
          "title": "Scarborough: Putin, Xi ‘See Joe Biden as Weak’ over Russia Statement",
          "text": "MSNBC “Morning Joe” host Joe Scarborough on Thursday reacted to President Joe Biden’s remarks regarding the rising tension between Ukraine and Russia.\n\nScarborough called it a “terrible moment” for Biden because it would only exacerbate Russian President Vladimir Putin and Chinese President Xi Jinping seeing him as “weak.”\n\n“It was a terrible moment in the press conference when he talked about a minor incursion. There is no minor incursion. There is separation among the NATO allies and ourselves on Russia,” Scarborough outlined. “There was separation because of the way we got out of Afghanistan. So, again, here is the problem. Biden seemed as weak from Russia, China and our allies on Afghanistan. If he’s seen as being weak on Ukraine, we’ll be back here six months from now talking about that minor incursion into Taiwan. The whole world is watching. Afghanistan set a poor precedent for Joe Biden.”\n\n“Fair or not — the Biden administration will tell you for two hours they did exactly what they needed to do, and it was a success in the end, and we’ll let historians debate that, but Putin and Xi and our NATO allies are not debating that right now,” he added. “They see Joe Biden as weak. Yesterday’s press conference did not help.”\n\nFollow Trent Baker on Twitter @MagnifiTrent",
          "link": "https://www.breitbart.com/clips/2022/01/20/scarborough-putin-xi-see-joe-biden-as-weak-over-russia-statement/",
          "published": "2022-01-20T00:00:00"
        },
        {
          "title": "Clyburn Echoes Biden: ‘Absolutely Concerned’ About Legitimacy of Elections in GOP-Led States",
          "text": "Thursday on CNN’s “New Day,” Rep. James Clyburn (D-SC) agreed with President Joe Biden questioning the legitimacy of the 2022 midterm elections depending on the passage of voting rights legislation.\n\nClyburn, noting changes to state election laws in GOP-led states like passing out water in voting lines, asked how could there be a legitimate election if there were “those kinds of things hanging over” voters. He said he was “absolutely concerned” about it.\n\n“[H]ow could it be a legitimate election if you’ve got those kinds of things hanging over you?” Clyburn questioned. “And so that’s what we’re trying to do here — put some federal oversight so when people make these kinds of felonious accusations at the voting booth, you can do something about it or at least prevent it.”\n\nCNN’s Kasie Hunt asked, “Do Democrats not need to make sure that there is confidence and faith in our election systems, even though, as you point out, they’re currently imperfect?”\n\n“Please tell me how can we make sure,” Clyburn replied. “You’ve got 19 states that have already passed 34 laws to make it harder to vote, to make the lines longer, getting rid of drop boxes so that people would not have the convenience of voting, and you tell me you want the Democrats to make sure that it’s fair? Do the Republicans have any responsibility for this? It’s their state. They are the majority in the legislature where these laws are being passed. Please talk to the Republicans and ask them, ‘Why are you doing this? What are you afraid of? What is it about democracy you do not want to have? Why do you want to install some cult as your party? And some cult leader as your presidential nominee?’ These are questions that I think need to be asked of the Republican Party. They are the ones making these changes.”\n\nFollow Trent Baker on Twitter @MagnifiTrent",
          "link": "https://www.breitbart.com/clips/2022/01/20/clyburn-echoes-biden-absolutely-concerned-about-legitimacy-of-elections-in-gop-led-states/",
          "published": "2022-01-20T00:00:00"
        }
      ]
    },
    "infowars": {
      "link": "https://www.infowars.com/",
      "articles": [
        {
          "title": "DISASTER: Joe Biden Crashes and Burns in First White House Presser of 2022",
          "text": "Joe Biden held his first White House press conference of 2022, and it was a complete and total disaster.\n\nBiden kicked off the Wednesday presser by blaming Republicans for his policy failures and insisting he did a great job as president in his first year.\n\nBiden: “What are Republicans for? What are they for? Name me one thing they’re for.” pic.twitter.com/BNF5fMd7ja — The Post Millennial (@TPostMillennial) January 19, 2022\n\nJoe Biden tries to downplay empty shelves:\n\n\n\n“I often see empty shelves being shown on television. 89% are full, which is only a few points below what it was before the pandemic.” pic.twitter.com/8oFmZmb6bY — Townhall.com (@townhallcom) January 19, 2022\n\nBiden even claimed he “over-performed” as president despite supply chain breakdowns, rampant inflation and energy price hikes.\n\nREPORTER: Inflation is up, your legislation is stalled…voting reform is going to fail, COVID-19 is still taking lives…and the nation’s divisions are still as raw as over a year ago. Did you over-promise?\n\n\n\nBIDEN: “I didn’t over promise but I have probably outperformed…” pic.twitter.com/ZsrHTAnKDq — Breaking911 (@Breaking911) January 19, 2022\n\nBiden: “For the first time in a long time, this country’s working people actually got a raise.”\n\n\n\nThis is false. Inflation is WIPING OUT wage gains. pic.twitter.com/oCcTztg2Gx — RNC Research (@RNCResearch) January 19, 2022\n\nBiden says Build Back Broke won’t “raise a single penny in taxes on people making under $400,000 a year.”\n\n\n\nHe’s lying. pic.twitter.com/tiImYWaCwQ — RNC Research (@RNCResearch) January 19, 2022\n\nBut things really went off the rails during the Q&A portion of the presser, where he admitted that Russian President Vladimir Putin would likely invade Ukraine in what he called a “minor incursion.”\n\nNOW – Biden on Russia invading Ukraine: “It depends on what it does. It’s one thing if it’s a minor incursion…”pic.twitter.com/vnkySSSX9f — Disclose.tv (@disclosetv) January 19, 2022\n\nBut don’t worry, Biden warned that Russia is “gonna pay” if they invade Ukraine.\n\nNOW – Biden on Russia: “If they invade, they’re gonna pay … Their banks will not be able to deal with dollars.”pic.twitter.com/WfoTX5MhxA — Disclose.tv (@disclosetv) January 19, 2022\n\nWhen asked if he would apologize for his botched withdrawal from Afghanistan last August, Biden refused, saying he’d “make no apologies.”\n\nBiden when asked about his DISASTROUS withdrawal from Afghanistan that lead to the death of 13 American Heroes:\n\n\n\n“I make no apologies for what I did.” pic.twitter.com/GtEKPJR6o3 — Benny (@bennyjohnson) January 19, 2022\n\nLater, Biden claimed the 2022 midterm elections won’t be “legitimate” if Republicans don’t help him pass the Democrats election overhaul legislation.\n\nREPORTER: “Do you still believe the upcoming election will be fairly conducted and its results will be legitimate?”\n\n\n\nPRES. BIDEN: “Well, it all depends…” pic.twitter.com/Bty4mvjsz4 — Breaking911 (@Breaking911) January 19, 2022\n\nWhen asked why such a large percentage of the electorate have “profound” concerns about his cognitive health, Biden fittingly replied, “I have no idea.”\n\nREPORTER: “Why do you suppose such large segments of the American electorate have come to harbor such profound concerns about your cognitive fitness?”\n\n\n\nBIDEN: “I have no idea.” pic.twitter.com/lcVi73WUSw — Breaking911 (@Breaking911) January 19, 2022\n\nBiden lost his temper at a reporter who pressed him about his divisive speech last week calling Republicans who oppose him as “domestic enemies.”\n\nJoe Biden gets very angry at @PhilipWegmann when he presses him about comparing Republicans who oppose his voting bill to George Wallace and Bull Connor\n\n\n\n“Go back and read what I said” pic.twitter.com/gpdPju14hC — Greg Price (@greg_price11) January 19, 2022\n\nIt wouldn’t be a proper Biden presser without the puppet president blanking out and rambling intermittently, which he certainly did while struggling to explain why he’s polling so low.\n\nThis is very hard to watch. pic.twitter.com/8OXkG9yweu — Greg Price (@greg_price11) January 19, 2022\n\nHe also claimed no other president has “done as much” as him in their first year.\n\nREPORTER: \"You told people…if voters give Democrats the House and the Senate and the Presidency, that all these big things can get accomplished…Why should folks believe you this time around?\"\n\n\n\nBIDEN: \"Can you think of any other president that has done as much in one year?\" pic.twitter.com/rnmFX5KnYZ — Breaking911 (@Breaking911) January 20, 2022\n\nFormer President Trump slammed Biden in a subsequent statement calling out his list of pre-approved reporters asking “softball” questions.\n\n“How come Biden picks a reporter off a list, in all cases softball questions, and then reads the answer? I would never have been allowed to get away with that, nor would I have to!” he wrote.\n\nNEW!\n\n\n\nPresident Donald J .Trump:\n\n\n\n“How come Biden picks a reporter off a list, in all cases softball questions, and then reads the answer? I would never have been allowed to get away with that, nor would I have to!” pic.twitter.com/SNikclCHyK — Liz Harrington (@realLizUSA) January 19, 2022\n\nWatch Biden’s full presser:\n\nDemocrat Approval Ratings Tank One Year Into Biden Administration",
          "link": "https://www.infowars.com/posts/disaster-joe-biden-crashes-and-burns-in-first-white-house-presser-of-2022/",
          "published": "2022-01-19T17:16:24"
        },
        {
          "title": "BUSTED: COVID Booster Shots Diminish Immune System",
          "text": "Brian Wilson breaks down statements from the European Medicines Agency, the World Health Organization, and virologist Dr. David Bauer that conclusively agree: taking consecutive booster shots in a short amount of time actually lowers the capability of immune systems to fight infection in the vaccinated.",
          "link": "https://www.infowars.com/posts/busted-covid-booster-shots-diminish-immune-system/",
          "published": "2022-01-19T10:37:11"
        },
        {
          "title": "COVID Vaccines Are Growing New Variants Inside Vaxxed Bodies, Claims Gates-Backed Doctor",
          "text": "A former Bill Gates-backed virologist Dr. Geert Vanden Bossche claims that COVID mRNA injections are creating more variants, will not stop the virus and should never be given to children.",
          "link": "https://www.infowars.com/posts/covid-vaccines-are-growing-new-variants-inside-vaxxed-bodies-claims-gates-backed-doctor/",
          "published": "2022-01-20T13:46:03"
        },
        {
          "title": "Stop Trying to Turn Economics into a Branch of Psychology",
          "text": "Recently, a relatively new economics called behavioral economics (BE) has started to gain popularity.\n\nIts practitioners, such as Daniel Kahneman, Vernon Smith, and Richard Thaler, were awarded Nobel Prizes for their contribution in the field of BE.\n\nThe BE framework emerged because of dissatisfaction with the neoclassical theory regarding consumer choices. In the neoclassical theory, individuals are presented as if a scale of preferences is hard-wired in their heads. Regardless of anything else, this scale remains the same all the time.\n\nThe practitioners of BE hold that this is unrealistic. To make the mainstream framework more realistic they are of the view that there is the need to introduce psychology into economics.\n\nIt is held that individual’s emotional state is a major factor in their decision process. If consumers are becoming more optimistic regarding the future then this is going to be an important message to businesses regarding investment decisions.\n\nAccording to BE researchers whether consumers are generally patient or impatient determines whether or not they are inclined to spend or save today. If they are more patient and save more, then this can generate funds for entrepreneurs’ new investment projects.\n\nBehavioral economists emphasize the importance of personality. An emphatic person is regarded more likely to make altruistic choices. Impulsive people are more likely to be impatient and not so good at saving up for their retirement. Venturesome people are more likely to take risks—they will be more likely to gamble.1\n\nWhilst the BE criticism of mainstream economics is valid, the question arises whether BE solves the issue of unchanged consumer preferences and presents consumers as real people and not as human machines.\n\nWe suggest that the key here is the definition of what human beings are all about. According to the BE, people are not rational in a sense that they are using reason in various decisions. According to BE practitioners, the key driver of consumer choices are emotions. On this, the Nobel Laureate Vernon Smith holds, “People like to believe that good decision making is a consequence of the use of reason, and that any influence that the emotions might have is antithetical to good decisions. What is not appreciated by Mises and others who similarly rely on the primacy of reason in the theory of choice is the constructive role that the emotions play in human action.”\n\nOnce the importance of reason is dismissed, what is then left is treating human beings like objects. According to this way of thinking, human action is not navigated by reason but by outside factors that act upon individuals. By means of a given stimulus, one can then observe various human reactions and draw all sorts of conclusions regarding the world of economics. According to Ludwig von Mises, however, “It is impossible to describe any human action if one does not refer to the meaning the actor sees in the stimulus as well as in the end his response is aiming at.”\n\nBy rejecting the importance of the human reason, behavioral and experimental economists treat human beings as another animal. In fact, some of the experimental economists are conducting various experiments on pigeons and rats in order to verify various propositions of mainstream economics.\n\nWhy Psychology Will Not Make Economics More Realistic\n\nPsychology is an important constituent in behavioral and experimental economics on the ground that human action and psychology are interrelated disciplines. There is however, a distinct difference between economics and psychology. Psychology deals with the content of ends. Economics, however, starts with the premise that people are pursuing purposeful conduct. It does not deal with the particular content of various ends.\n\nAccording to Murray N. Rothbard, “A man’s ends may be ‘egoistic’ or ‘altruistic’, ‘refined’ or ‘vulgar’. They may emphasize the enjoyment of ‘material goods’ and comforts, or they may stress the ascetic life. Economics is not concerned with their content, and its laws apply regardless of the nature of these ends,” whereas “[p]sychology and ethics deal with the content of human ends; they ask, why does the man choose such and such ends, or what ends should men value?”\n\nTherefore, economics deals with any given end and with the formal implications of the fact that men have ends and utilize means to attain these ends. Consequently, economics is a separate discipline from psychology. By introducing psychology into economics, one obliterates the generality of the theory.\n\nContrary to mainstream thinking, the Austrian school of economics always held that valuations do not exist by themselves regardless of the things to be valued. On this Rothbard wrote, “There can be no valuation without things to be valued.” Valuation is the outcome of the mind valuing things. It is a relation between the mind and things.\n\nNow, if preferences are constant then it is possible to compress these preferences into a mathematical formulation, i.e., one can capture people’s wishes by means of a formula, so it is held. This is labelled by mainstream economics as a utility function.\n\nObviously, people do change their minds, so it is not surprising that BE practitioners have “discovered” that real people’s behaviour systematically deviates from the one of the human machine as depicted by the mainstream economics.\n\nThe Misesian Framework of Consumer Choices\n\nFollowing the Mises’s framework of thinking, we can ascertain the distinguishing characteristic and the meaning of human action. For instance, one can observe that people are engaged in a variety of activities. They may be performing manual work, driving cars, walking on the street or dining in restaurants. The distinguishing characteristic of these activities is that they are all purposeful.\n\nFurthermore, we can establish the meaning of these activities. Thus, manual work may be a means for some people to earn money, which in turn enables them to achieve various goals like buying food or clothing. Dining in a restaurant can be a means for establishing business relationships. Driving a car may be a means for reaching a particular destination.\n\nPeople operate within a framework of ends and means; they use various means to secure ends. We can conclude from the above that actions are conscious and purposeful.\n\nThe knowledge that human action is conscious and purposeful is certain and not tentative. Anyone who tries to object to this contradicts himself for he is engaged in a purposeful and conscious action to argue that human actions are not conscious and purposeful.\n\nVarious conclusions that are derived from this knowledge of conscious and purposeful action are valid as well, implying that there is no need to subject them to various laboratory tests as is done in the experimental economics. For something that is certain knowledge, there is no requirement for any empirical testing.\n\nBehavioral and experimental economists such as Nobel Laureate Vernon Smith, reject however the view that human actions are conscious and purposeful. According to Smith,\n\nHe [Mises] wants to claim that human action is consciously purposeful. But this is not a necessary condition for his system. Markets are out there doing their thing whether or not the mainspring of human action involves self-aware deliberative choice. He vastly understates the operation of unconscious mental processes. Most of what we know we do not remember learning, nor is the learning process accessible to our conscious experience—the mind…. Even important decision problems we face are processed by the brain below conscious accessibility.\n\nMeans-Ends and Consumer Choices\n\nPurposeful action implies that people assess or evaluate various means at their disposal against their ends. Individual ends set the standard for human valuations and thus choices. By choosing a particular end, an individual also sets a standard of evaluating various means.\n\nIf my end is to provide a good education for my child, then I will explore various educational institutions and will grade them in accordance with my information regarding the quality of education that these institutions are providing. Observe that my standard of grading these institutions is my end, which is to provide my child with a good education.\n\nAlternatively, if my intention is to buy a car, there are all sorts of cars available in the market, and as such, I have to specify to myself the specific ends that the car will help me to achieve. Since an individual’s ends determine his evaluations of means and thus his choices, it follows that the same good will be valued differently by the individual as a result of changes in his ends.\n\nAt any point in time, people have an abundance of ends that they would like to achieve. What limits the attainment of various ends is the scarcity of means. Hence, once more means become available, a greater number of ends, or goals, can be accommodated—i.e., people’s living standards will increase.\n\nAnother limitation on attaining various goals is the availability of suitable means. Thus to quell my thirst in the desert, I require water. Diamonds in my possession will be of no help in this regard.\n\nObserve that the means-end framework is the essence of any human action whether the action is in accordance with what is regarded as rational conduct, or not.\n\nFurthermore, once it is accepted that human actions are conscious and purposeful it will not make much sense to extract preferences in a laboratory, or by means of questionnaires, since only something that is constant can be extracted.\n\nConclusions\n\nBy casting doubt on the notion that reason is the main faculty that navigates human actions behavioral economics emphasizes the importance of emotions as the key driving factor of human actions.\n\nBy means of psychological analysis, the practitioners of behavioral economics have supposedly demonstrated that people’s conduct is irrational.\n\nConsequently, the practitioners of behavioral economics may have unintentionally laid the foundation for the introduction of government controls to “protect” individuals from their own irrational behavior.\n\nFor instance, wide fluctuations in financial markets can be attributed to irrational behavior, which can damage the economy. Hence, it will make a lot of sense to restrain this irrationality by a dosage of restraining regulations.",
          "link": "https://www.infowars.com/posts/stop-trying-to-turn-economics-into-a-branch-of-psychology/",
          "published": "2022-01-20T14:07:26"
        }
      ]
    },
    "foxnews": {
      "link": "http://www.foxnews.com/",
      "articles": []
    },
    "nbcnews": {
      "link": "http://www.nbcnews.com/",
      "articles": [
        {
          "title": "Georgia prosecutor requests special grand jury in Trump election probe",
          "text": "A Georgia prosecutor on Thursday requested a special grand jury to aid her investigation into possible 2020 election interference by former President Donald Trump and others.\n\nFulton County District Attorney Fani Willis sent a letter, obtained by NBC News, to Fulton County Superior Court Chief Judge Christopher Brasher asking for a special grand jury to investigate any \"coordinated attempts to unlawfully alter the outcome of the 2020 elections in this state.\"\n\nA significant number of witnesses have refused to cooperate with the investigation without a subpoena requiring their testimony, Willis wrote.\n\nWillis cited a NBC \"Meet the Press\" interview where Georgia Secretary of State Brad Raffensperger said he would gladly respond to a grand jury summons.\n\nA special grand jury would have the power to subpoena witnesses.\n\nWillis has declined to speak about the specifics of her investigation, but in an interview with The Associated Press earlier this month she confirmed that its scope includes — but is not limited to — a Jan. 2, 2021, phone call between Trump and Raffensperger; a November 2020 phone call between Sen. Lindsey Graham, R-S.C., and Raffensperger; the abrupt resignation of the U.S. attorney in Atlanta on Jan. 4, 2021; as well as comments made during December 2020 Georgia legislative committee hearings on the election.\n\nWillis said the special grand jury is needed because it can serve a term longer than a normal grand jury term. It would also be able to focus on this investigation alone, allowing it to focus on the complex facts and circumstances. And having a special grand jury would mean that the regular seated grand jury wouldn't have to deal with this investigation in addition to their regular duties, she wrote.\n\nIn a statement, Trump defended his phone call with Raffensperger, calling it \"perfect.\" He also reiterated false claims of election fraud, suggesting that the special grand jury should investigate his claims rather than his phone call.\n\nA spokesman for Willis said there was no further statement beyond the contents of the letter at this time.",
          "link": "https://www.nbcnews.com/politics/donald-trump/georgia-da-asks-special-grand-jury-trump-election-probe-n1287773",
          "published": "2022-01-20T18:19:00+00:00"
        },
        {
          "title": "Top Georgia election official Raffensperger details Trump call for Jan. 6 committee",
          "text": "The House committee investigating the Jan. 6 attack on the U.S. Capitol interviewed Georgia Secretary of State Brad Raffensperger for several hours Tuesday in a meeting that included discussion of former President Donald Trump's efforts to overturn the 2020 election results.\n\n“I spoke to the January 6th committee to ensure they included the full record of how stolen election claims damage our democracy — whether in 2016, 2018, or 2020. While liberals in Washington, D.C. remain focused on Trump, conservatives should focus on the kitchen table issues that really matter to the American people,” Raffensperger, a Republican who is the state's top elections official, said in a statement.\n\nThe meeting was first reported by the Atlanta Journal-Constitution.\n\nThe interview lasted four hours, Raffensperger's office said, and they discussed the call this year in which Trump pressured Raffensperger to overturn President Joe Biden's win in Georgia while repeatedly berating state officials.\n\nIn a recent book, Raffensperger wrote that he felt Trump was threatening him in the call. He now faces a Trump-endorsed primary challenger in his re-election bid next year.\n\nThe House committee has interviewed or deposed numerous people about the events leading up to the Jan. 6 riot and the attack itself.\n\nEarlier Tuesday, the chair of the House committee, Bennie Thompson, D-Miss., said former White House chief of staff Mark Meadows has begun cooperating. His cooperation comes not long after former Trump adviser Steve Bannon was indicted by a federal grand jury and charged with two counts of contempt of Congress for refusing to answer the committee's questions.\n\nIf he is convicted, Bannon could face as long as a year in prison and a fine of up to $100,000.",
          "link": "https://www.nbcnews.com/politics/congress/top-georgia-election-official-raffensperger-details-trump-call-jan-6-n1285123",
          "published": "2021-12-01T00:46:00+00:00"
        },
        {
          "title": "Jan. 6 committee asks Ivanka Trump to give voluntary testimony",
          "text": "WASHINGTON — The House committee investigating the Jan. 6 riot at the U.S. Capitol has invited Ivanka Trump to give voluntary testimony.\n\nIn a letter sent Thursday to former President Donald Trump's eldest daughter, who served as a top White House adviser, the committee's chair, Rep. Bennie Thompson, D-Miss., said it was seeking information about her communications with the White House surrounding the attack.\n\nThe committee said it that has evidence that Ivanka Trump was \"in direct contact\" with her father on the day of the riot and that she may have \"direct knowledge\" of the former president's efforts to convince then-Vice President Mike Pence to block Congress' certification of the 2020 election results.\n\nA spokesperson for Ivanka Trump told NBC News that she \"just learned that the January 6 Committee issued a public letter asking her to appear. As the Committee already knows, Ivanka did not speak at the January 6 rally. As she publicly stated that day at 3:15pm, ‘any security breach or disrespect to our law enforcement is unacceptable. The violence must stop immediately. Please be peaceful.’”\n\nThe committee's letter does not allege that she spoke at the rally.\n\nThe committee said it obtained text exchanges and testimony given by White House officials at the time describing efforts to convince the former president to intervene in the riot. The letter cited a text message exchange that it says occurred between a White House staff member and a person outside the White House.\n\n\"Is someone getting to potus? He has to tell protestors to dissipate. Someone is going to get killed,\" said a person outside the White House staff, according to the committee.\n\nAccording to the committee, the White House staff member replied: \"I've been trying for the last 30 minutes. Literally stormed in outer oval to get him to put out the first one. It's completely insane.\"\n\nThe letter also cited testimony from Keith Kellogg, who was Pence's national security adviser at the time and told the committee that Ivanka Trump made multiple attempts to convince her father to step in.\n\nThe committee also wants to discuss the effort after the attack \"to persuade President Trump not to associate himself with certain people, and to avoid further discussion regarding election fraud allegations,\" said the letter.\n\nThe committee said it also obtained texts between Fox News host Sean Hannity and then-White House press secretary Kayleigh McEnany on Jan. 7 laying out a planned approach for conversations with Trump.\n\n\"No more stolen election talk,\" said Hannity in a text to McEnany, according to the letter.\n\nThe letter says she replied: \"Love that. Thank you. That is the playbook. I will help reinforce ... \"\n\nThompson requested to meet with Ivanka Trump in early February.\n\nEarlier this month, Rep. Liz Cheney, R-Wyo., said the panel has testimony that Ivanka Trump asked her father to intervene as his supporters ransacked the Capitol.\n\n\"The committee has firsthand testimony now that he was sitting in the dining room next to the Oval Office watching the attack on television as the assault on the Capitol occurred. We know, as you know well, that the briefing room at the White House is just a mere few steps from the Oval Office,\" Cheney, the vice chair of the committee, said on ABC News' \"This Week\" on Jan. 2.\n\nShe said that at any moment, Trump could have walked to the briefing room and appeared on television.\n\n\"We know members of his family, we know his daughter — we have firsthand testimony that his daughter Ivanka went in at least twice to ask him to please stop this violence,\" Cheney said.\n\nOver the past few months, the committee has been accelerating its investigation into the riot, as well as any actions or inaction by Trump and his allies. The panel also recently asked Reps. Jim Jordan, R-Ohio, and Scott Perry, R-Pa., to provide information about their activities. Thompson, as chairman, said that the committee's ability to subpoena the two lawmakers remains uncertain.",
          "link": "https://www.nbcnews.com/politics/congress/jan-6-committee-says-it-will-ask-ivanka-trump-give-n1287771",
          "published": "2022-01-20T18:59:00+00:00"
        }
      ]
    },
    "washingtonpost": {
      "rss": "http://feeds.washingtonpost.com/rss/world",
      "link": "https://www.washingtonpost.com/",
      "articles": [
        {
          "link": "https://www.washingtonpost.com/sports/olympics/2022/01/20/china-winter-olympics-snow-pollution/?utm_source=rss&utm_medium=referral&utm_campaign=wp_world",
          "published": "2022-01-20T08:47:52",
          "title": "In parched Beijing, claims of a ‘green’ Olympics may not hold water",
          "text": "It remains unclear how Beijing has been able to ensure vast quantities of artificial snow are available without depleting water supplies. Officials have said that water demand during the Games will account for 1.6 percent of the “total current water consumption” in Yanqing district of Beijing and 9.8 percent in Chongli, the district of Zhangjiakou where events will be held, without specifying whether this is a total figure that accounts for piles of reserve snow made ahead of time. Final water-use data are meant to be released after the Closing Ceremonies."
        },
        {
          "link": "https://www.washingtonpost.com/world/2022/01/20/european-union-digital-services-act/?utm_source=rss&utm_medium=referral&utm_campaign=wp_world",
          "published": "2022-01-20T07:51:53",
          "title": "European Parliament gives initial approval to rules that would change big tech data collection, advertising",
          "text": "Members had considered including a provision that would have completely banned targeted advertising — the practice of using information collected from users’ browsing history to tailor ads to them. They decided instead to give users the ability to opt out of certain types of tracking by changing a setting on their browsers. Currently, European websites ask users what types of tracking they would like to disable each time they visit."
        },
        {
          "link": "https://www.washingtonpost.com/national-security/mit-gang-chen-dismiss/2022/01/20/912f68aa-786b-11ec-bf97-6eac6f77fba2_story.html?utm_source=rss&utm_medium=referral&utm_campaign=wp_world",
          "published": "2022-01-20T06:35:00",
          "title": "Charges dismissed against MIT professor accused of hiding research ties to China",
          "text": "The caucus has called for an end to the initiative, which former Justice Department officials say would be like throwing the baby out with the bathwater. They point out that most of the problematic cases have been those that involve allegations of academic grant fraud; the vast majority of cases — targeting economic espionage, trade secret theft and illegal export of military-use items — have not been controversial."
        },
        {
          "link": "https://www.washingtonpost.com/world/2022/01/20/tahiti-coral-reef-discovery/?utm_source=rss&utm_medium=referral&utm_campaign=wp_world",
          "published": "2022-01-20T06:09:40",
          "title": "Explorers discover ‘unrivaled’ reef of rose-shaped corals that could hold lessons for warming oceans",
          "text": "Discovered off the coast of Tahiti, an island in the Pacific Ocean that is part of French Polynesia, the reef has been explored since late last year and is estimated to be almost two miles long. The expedition project 1Ocean, which was involved in the exploration, said the reef’s state of conservation is “unrivaled” at a time when global warming, pollution and overfishing are threatening corals’ survival."
        }
      ]
    },
    "theonion": {
      "link": "http://www.theonion.com/",
      "articles": []
    }
  }
}